# GetNumericRevisionSettings Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
RevisionSettings..::..GetNumericRevisionSettings Method
RevisionSettings Class See Also
---
Returns a copy of the NumericRevisionSettings owned by this RevisionSettings object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
[ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.GetAllRevisionNumberingSequences` instead.")]
public NumericRevisionSettings GetNumericRevisionSettings()
```

Visual Basic
---
```text
<ObsoleteAttribute("This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.GetAllRevisionNumberingSequences` instead.")> _
Public Function GetNumericRevisionSettings As NumericRevisionSettings
```

Visual C++
---
```text
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and may be removed in a later version of Revit. Please use `RevisionNumberingSequence.GetAllRevisionNumberingSequences` instead.")]
public:
NumericRevisionSettings^ GetNumericRevisionSettings()
```

# ### Return Value
The copy of the NumericRevisionSettings owned by this RevisionSettings object.
# See Also
RevisionSettings Class
Autodesk.Revit.DB Namespace